{"title": "Raspberry Chocolate Chip Cookies", "slug": "raspberry-chocolate-chip-cookie", "description": "A Natasha Original", "ingredients": ["3/4 cup unsalted butter, browned", "3/4 cup brown sugar, packed", "1/4 cup raspberry jam", "1 egg + 1 egg yolk", "1 3/4 cup all purpose flour", "1/2 teaspoon baking soda", "4 teaspoons raspberry powder", "1/2 teaspoon salt", "1 cup semisweet chocolate chips"], "steps": ["Brown the butter, then chill until set. Mix the brown sugar into the chilled brown butter, then add the raspberry jam and egg.", "Whisk the flour, salt, baking soda and raspberry powder together.", "Mix in half the flour then slowly add the rest stopping if the dough gets dry. Before it's 100% mixed add the chocolate chips.", "Portion the dough out into 12 normal sized cookies or 24 mini cookies. Put on a cookie sheet and REFRIGERATE for at least 12 hours.", "When ready to bake, preheat the oven to 350 F. Put the refrigerated cookies onto a sheet and squish them to cookie shape, they wont spread out much.", "Bake for like 8-12 minutes or until they're done."], "tags": ["Dessert"], "status": "PUBLISHED"}
{"title": "Chicken Stew", "slug": "chicken-stew", "description": "Natasha's Version", "ingredients": ["1 onion", "4 celery stalks, thickly sliced", "5 medium carrots, thickly sliced", "2 cartons (8 cups) chicken stock", "4 cloves garlic, smashed", "1 bay leaf", "3 sprigs flat-leaf parsley", "3-4 pound breast meat, don't bother with whole chicken unless making stock with the bones after", "white wine"], "steps": ["Put the chicken in a pot with the chicken stock and bay leaf, bring to a boil then reduce to a simmer until the chicken is cooked. Pull the chicken apart or chop into pieces. Return to broth for 15 minutes or until chicken reaches 165 F.", "Sautee the onions in a bit of olive oil until translucent and starting to brown, then add garlic. ", "Add the carrots and celery to the onions, increase heat to high and when hot, add white wine.", "Add the veggies to the stock with the chicken, pouring some liquid from the chicken pot into the pan to get all the bits."], "tags": ["Dinner", "Easy"], "status": "PUBLISHED"}
{"title": "Brownie-In-A-Mug", "slug": "brownie-in-a-mug", "description": "Single-serve brownie in minutes", "ingredients": ["1/4 cup (30 g) flour", "1/4 cup (50 g) sugar", "2 Tablespoons (13 g) cocoa (natural, unsweetened)", "pinch of salt", "1/4 cup (60 ml) water", "2 tablespoons (30 ml) melted butter, or neutral oil", "1/8 teaspoon vanilla extract", "1 small scoop of ice cream to serve"], "steps": ["Place flour, sugar, cocoa, salt, and cinnamon in a microwave safe ceramic mug. Stir with a fork or spoon to mix well and break up any clumps. Add the butter or oil, water, and vanilla to the cup and stir until the mixture is smooth and there are no lumps. Place in microwave and heat on high until the mixture is cooked through, about a 1 minute and 40 seconds for a 1000 watt microwave, or 1 minute 10 seconds on a 1650 watt microwave.", " It should still be moist when cooked through, not dry. Top with ice cream! Let cool for a minute and serve with a scoop of vanilla ice cream or a teaspoon or two of whipping cream poured over."], "tags": ["Dessert", "1 serving"], "status": "PENDING"}
{"title": "Compost Cookies", "slug": "compost-cookies", "description": "Milk Bar copy-cat", "ingredients": ["225g (16 tablespoons) butter at room temperature", "200g (1 cup) granulated sugar", "150g (2/3 cup tightly packed) light brown sugar", "50g (2 tbs) glucose", "1 egg", "2g (1/2 tsp) vanilla extract", "225g (1 1/3 cups) flour", "2g (1/2 tsp) baking powder", "1.5g (1/4 tsp) baking soda", "4g (1 tsp) kosher salt", "150g (3/4 cup) mini chocolate chips", "100g (1/2 cup) mini butterscotch chips (optional)", "1/2 cup graham crust/ crushed graham crackers", "40g (1/3 cup) old-fashioned rolled oats", "50g (2 cups) potato chips (Cape Cod)", "50g (1 cup) mini pretzels"], "steps": ["Stand mixer the butter, sugars, glucose. Then add egg and vanilla, mix 8 minutes.", "Whisk flour, baking powder, baking soda, salt - slowly add to mixer on low until combined.", "Add the chocolate chips, other chips and graham crakers first, then gently add chips and pretzels so they don't break up too much.", "Portion cookies onto sheet pan, squish flat a bit. Fridge for 1 hour up to 1 week.", "Bake directly from fridge.", "375 F 18 minutes, until brown edges."], "tags": ["Dessert"], "status": "PUBLISHED"}
{"title": "Braised Short Rib", "slug": "braised-short-rib", "description": "Delicious fall or winter meal", "ingredients": ["4 lbs. bone-in short rib", "3-4 big carrots", "2 medium yellow onions or 1 large", "3-4 stalks of celery", "2 Tbsp tomato paste", "1 750ml bottle dry red wine, (cabernet, merlot)", "veggie or beef stock", "1/4 cup flour"], "steps": ["Pat dry and score the fat cap of the short ribs in criss-cross style. Add to a deep oven dish, fat side up. Brush with olive oil and add salt and pepper.", "Roast in the oven at 425 for 20 minutes.", "While the meat is roasting, chop the carrots, onions and celery into small-medium sized pieces. Add to a deep pan on the stove (this will eventually be the pan that goes into the oven) with some olive oil and sauté (20 mins).", "Create a well in the veggies and add more oil and the tomato paste. Cook the tomato paste in the oil for 1-2 minutes then stir into the veggies. Turn the heat to high and when heated, add 3/4 of the wine.", "Keep wine at a simmer until it has reduced slightly.", "In a separate pan, dry toast the flour over medium heat - add oil to the flour and cook until the flour-oil paste is slightly toasted. Pour this mixture into the veggie-wine pan.", "This will thicken the sauce significantly, add broth/stock until the sauce is slightly thinner than you want it.", "Remove the meat from the oven and take it out of the pan being careful to leave the excess fat behind. Roll the meat in the veggie sauce and nestle into the pan fat side up. Add broth until the level is about halfway up the ribs.", "Cook in the oven at 350 for at least 4 hours with the lid on the pan.", "When done, remove the meat from the sauce and scoop any excess oil out. Blend the veggies into a sauce (immersion blender). Take the meat off the bone if desired and cut into portions.", "Mix meat into the sauce and serve."], "tags": ["Dinner"], "status": "PUBLISHED"}
{"title": "Brown Butter Cookie Base", "slug": "brown-butter-cookie-base", "description": "Base recipe for cookies", "ingredients": ["3/4 cup unsalted butter, browned", "3/4 cup brown sugar, packed", "1/4 cup granulated sugar", "1 egg + 1 egg yolk", "2 teaspoons vanilla extract", "1 3/4 cup all purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 cup mixins"], "steps": ["350°F", "Brown the butter over medium heat, stirring constantly until the butter begins to foam and turns a golden brown, emitting a nutty aroma. Make sure you only brown the butter lightly. When butter browns the liquid evaporates off which can dry out your dough. As soon as the butter starts to turn brown and smell nutty, take it off the heat to prevent any more liquid from escaping. Take butter off the heat and allow to set up.", "In a large mixing bowl combine the cooled brown butter, brown sugar, and white sugar. Beat until mixed together. Add in the egg, egg yolk, and vanilla extract. Mix well.", "In separate bowl mix together the flour, salt and baking soda. Mix half the dry ingredients into the wet until everything comes together. Slowly add in the remaining flour a little bit at a time. Fold in the mixins. Do not over mix.", "Scoop the cookie dough into 1 Tablespoon size balls and refrigerate the cookie dough for at least a half hour, or overnight.", "Bake at 350°F for 11-13 minutes or until the edges are set and the centers have puffed up but are still gooey."], "tags": ["Dessert", "Base"], "status": "PUBLISHED"}
{"title": "Thanksgiving Apple Pie", "slug": "thanksgiving-apple-pie", "description": "A classic", "ingredients": ["For the dough:", "3½ cups all-purpose flour", "2 Tbsp. granulated sugar", "1½ tsp. kosher salt", "3 sticks chilled unsalted butter, cut into pieces", "2 Tbsp. apple cider vinegar", "½ cup ice water", "For the filling:", "4 lb. Pink Lady, Honeycrip or other firm, sweet-tart apples, peeled, cored, thinly sliced", "⅓ cup (packed) dark brown sugar", "¼ cup granulated sugar", "2 Tbsp. fresh lemon juice", "2 tsp. ground cinnamon", "½ tsp. kosher salt", "¼ tsp. ground allspice", "¼ tsp. ground cardamom", "1½ cups APPLE CIDER or APPLE JUICE", "2 tsp. vanilla extract or paste", "2 Tbsp. cornstarch"], "steps": ["Bakes at 375° for 1½-2 hours.", "Mix butter into flour leaving some butter sheets. Combine vinegar and ½ cup ice water in a small bowl and drizzle over flour mixture, mixing with a fork to combine.", "Working with half of the dough, press into a single mass, incorporating dry bits, then pat down to make a ¾\"-thick square. Using a bench scraper or knife, divide dough into 4 pieces. Stack pieces on top of one another, placing any unincorporated dry bits in between layers, and press down to combine. Form dough into a ¾\"-thick disk and wrap tightly in plastic. Repeat with remaining dough. Chill at least 2 hours.", "Toss apples with brown sugar, granulated sugar, lemon juice, cinnamon, salt, allspice, and cardamom in a large bowl to coat. Let apples sit until they start to release their juices, at least 1 hour and up to 3 hours.", "Place apple cider in a medium saucepan and scrape in seeds from vanilla bean; add pod. Bring to a boil and cook, whisking occasionally, until reduced by two-thirds. Pour off juices that have accumulated in bowl of apples and add to apple cider. Return to a boil and cook until reduced to about ½ cup; remove vanilla pod. Stir cornstarch into 3 Tbsp. water in a small bowl to dissolve, then whisk into apple cider. Cook, whisking constantly, until cider mixture is very thick and bubbling, about 1 minute. Let cool slightly, then scrape over apples; toss to coat.", "Carefully transfer dough round to pie dish. Lift up edges and allow dough to slump down into dish (if too cold to be pliable, let it warm up slightly first). Press dough firmly against sides and bottom of plate. Trim, leaving about 1\" overhang. Beat egg with 1 tsp. water in a small bowl and brush over edges of dough. Scrape in apple filling, creating a mound in the center; dot filling with butter. Place remaining dough round over filling. Trim edges of top round, leaving a ½\" overhang. Fold edge of bottom round up and over; press together to seal. Crimp edge and brush top with remaining egg wash. Sprinkle with demerara sugar and use a sharp knife to cut a few vents in top. Place pie on a foil-lined rimmed baking sheet and chill in freezer 10 minutes. Preheat oven to 375°.", "Bake pie until crust is deep golden brown and juices are thick and bubbling, 1½-2 hours (yes: 2 hours!). Transfer pie to a wire rack and let cool at least 4 hours before serving."], "tags": ["Dessert", "Holiday"], "status": "PENDING"}
{"title": "Lemon Meringue Pie", "slug": "lemon-meringue-pie", "description": "Alex's birthday pie", "ingredients": ["2 tbsp granulated sugar", "2 tsp Diamond Crystal or 1 tsp. Morton kosher salt", "2⅔ cups all-purpose flour, plus more for dusting", "1½ cups (3 sticks) chilled unsalted butter, cut into ½ inch pieces", "1 cup sugar", "⅓ cup cornstarch", "2 large eggs", "4 large egg yolks", "Zest of 4 lemons", "1 cup fresh lemon juice", "1 tsp kosher salt", "3 tbsp chilled unsalted butter", "4 large egg whites", "¾ cup sugar", "½ tsp kosher salt", "¼ tsp cream of tartar"], "steps": ["Crust", "Whisk sugar, salt, and 2⅔ cups flour in a large bowl. Add butter and, using your fingers, smash each piece into a thin disk. Take your time doing this and don’t feel compelled to break butter into even smaller pieces. Drizzle ⅔ cup ice water over, dispersing it as widely as possible, and mix with a rubber spatula to bring mixture together into a shaggy mass.", "Turn dough out onto a surface and work together with your hands, pushing and flattening until dough holds together when squeezed in your palm but some streaks of dry flour are still visible. Divide dough into 2 portions.", "Flatten 1 portion of dough into an 8 inch diameter disk. Cut into quarters, stack pieces on top of one another, and flatten dough with a rolling pin to about half of its original height. At this point dough should hold together with no dry spots remaining, and have nice big flakes of butter showing. Use a bench scraper or a large knife to clean any clingy bits of dough from surface. Dust surface with flour, then dust top of dough with flour. Roll out to a ¼–⅜ inch thick round. Wrap dough around rolling pin and transfer to a standard 9 inch diameter pie dish. Unfurl into dish, then lift edges and allow dough to slump down into dish. Trim overhang to an even 1 inch (there will be some excess). Fold overhang under and crimp as desired. Cover and chill until very cold, at least 1 hour and up to 12 hours (cover tightly if chilling longer than 1 hour). Repeat process with remaining dough and another pie dish. Or form into a 1½ inch thick disk, wrap in plastic, and chill up to 3 days (or freeze up to 1 month).", "Place a rack in middle of oven; preheat oven to 400°. Lay 2 sheets of parchment paper over dough and fill with pie weights or dried beans (they should fill the dish). Set on a foil-lined rimmed baking sheet (this will keep any butter drips from smoking up your oven). Bake until edges are golden brown and bottom is opaque (carefully lift parchment to check), 30–35 minutes. Remove from oven; reduce oven temperature to 300°. Lift out parchment and weights. Bake crust until evenly chestnut brown all over, 10–15 minutes. If baking both crusts, turn oven dial back up to 400° and let oven preheat; repeat with remaining crust.", "Filling", "Whisk sugar and cornstarch in a large saucepan to combine. Add eggs and egg yolks and whisk vigorously, making sure to get into corners of pan, until smooth and pale. Whisk in lemon zest and juice, salt, and 1½ cups water.", "Place saucepan over medium heat and bring to a simmer, whisking often and making sure to get into corners of pan, 8–10 minutes (mixture should be bubbling and thickened). Reduce heat and continue to simmer, whisking constantly, 3 minutes. Let cool 5 minutes, whisking every minute.", "Add butter to filling and whisk until melted and fully incorporated. Scrape filling into pie crust; smooth surface. Chill until cold and set, at least 2 hours and up to 3 days.", "Assembly", "Combine egg whites, sugar, salt, and cream of tartar in the bowl of a stand mixer or another large heatproof bowl; set over a large saucepan filled with 1 inch simmering water (bowl shouldn’t touch the water). Heat, stirring constantly, until sugar is dissolved and mixture is warm to the touch, about 4 minutes.", "Fit bowl onto mixer fitted with whisk attachment (or use an electric mixer) and beat on medium-high speed until meringue is more than tripled in volume and medium peaks form, about 4 minutes. Transfer to a piping bag fitted with a large round tip (or a resealable plastic bag will work—just snip off a corner after bag is filled). Pipe meringue over filling and toast with a kitchen torch or under the broiler."], "tags": ["Dessert", "Birthday"], "status": "PUBLISHED"}
{"title": "Beet & Goat Cheese Pasta", "slug": "pink-pasta", "description": "", "ingredients": ["3 medium-large sized beets", "4 oz goat cheese", "1 clove garlic", "1 pinch cayenne pepper", "Olive oil", "pistachios toasted and chopped", "fresh mint leaves for garnish (optional)", "Pasta"], "steps": ["Cook pasta.", "Blend cooked beets, goat cheese, olive oil and garlic with pasta water until smooth.", "Combine pasta and sauce and garnish with pistachios and mint leaves."], "tags": ["Dinner", "Easy"], "status": "PUBLISHED"}
